# На вход программе подается строка текста, содержащая слова. Напишите программу,
# которая выводит слова введенной строки в столбик.
# Примечание. Программу можно написать в одну строку кода.

print(*input().split(), sep='\n')
