# Напишите программу, определяющую площадь круга и длину окружности по заданному радиусу R.

from math import pi
rad = float(input())
print(pi * rad ** 2)
print(2 * pi * rad)
