# Напишите программу, которая считывает с клавиатуры название футбольной команды и выводит информацию о ней в следующем формате

team = input()
print("Футбольная команда", team, "имеет длину", len(team), "символов")