# Напишите программу, которая считывает с клавиатуры две строки – имя и фамилию пользователя и выводит фразу

name = input()
surname = input()
print("Hello", str(name), str(surname) + '!',  "You have just delved into Python")