# Напишите программу, которая определяет, какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.

temp = float(input())
print(5 / 9 * (temp - 32))
