# Дано положительное действительное число. Выведите его дробную часть.

num = float(input())
num1 = int(num)
print(num - num1)
