# Определите, через какое время (в часах) старушки встретятся, если расстояние между ними равно S км.
s, v1, v2 = float(input()), float(input()), float(input())
t = s / (v1 + v2)
print(t)