# На вход программе подаётся положительное четырёхзначное целое число.
# Программа должна вывести текст в соответствии с условием задачи

d1, d2, d3, d4 = input()
print('The digit in the thousands position is', d1)
print('The digit in the hundreds position is', d2)
print('The digit in the tens position is', d3)
print('The digit in the units position is', d4)
