# Напишите программу, которая определяет наименьшее из двух чисел.

num1, num2 = int(input()), int(input())
if num1 < num2:
    print(num1)
else:
    print(num2)