# Напишите программу, которая определяет наименьшее из двух чисел.

d1, d2 = int(input()), int(input())
if d1 < d2:
    print(d1)
else:
    print(d2)