# Напишите программу, которая печатает звездный прямоугольник размерами n×19

high = int(input())
for _ in range(high):
    print('*' * 19)