# На вход программе подаются три строки: имя, фамилия и отчество (именно в таком порядке). Напишите программу, которая выводит инициалы человека (ФИО).

name = input()
lastname = input()
surname = input()
print(lastname[0] + name[0] + surname[0])